3A/SE350/Virtual-Memory.org
#+title: Virtual Memory
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode

* Hardware and Control Structures
Key characteristics of paging and segmentation are:
1. All memory references within a process are logical addresses that are dynamically
   translated into physical adddresses at runtime, allowing a process to be swapped
   in and out of main memory (can occupy different regions of main memory at
   different times)
2. A process can be broken into pieces (pages or segments) that need not be contiguous
   in main memory during execution

This ultimately means that not all pages or segments of a process need to be in main
memory during execution, only the next instruction to be fetched and next data location
to be accessed must be in main memory.

As a process executes, the procesor can determine if a memory reference is in the
resident set using the page/segment table, if not it can generate an interrupt
for a memory access fault.
This blocks the process so that the OS can bring that piece of the process into
main memory using a disk IO read request.

** Virtual Memory
*Virtual memory*: a storage allocation scheme in which secondary memory can be addressed
as though it were part of main memory, where addresses a program uses are different from
addresses the memory system uses to identify storage sites through translation

Amount of virtual storage is limited by the addressing scheme of the computer and the
amount of secondary memory available, not main memory.

*Virtual address*: address assigned to a location in virtual memory to allow that location
to be accessed as if it were in main memory

*Virtual address space*: virtual storage assigned to a process

*Address space* range of memory addresses available to a process

*Real address*: address of a storage location in main memory

*Resident set*: portion of a process that is in main memory

Implications of virtual memory:
1. More processes maintainted in main memory since only portions of each process are in
   main memory, which more efficiently uses the processor especially with context
   switching.
2. Processes can be larger than main memory so programmers do not need to worry about
   the size of their program as the OS manages virtual memory based on paging or
   segmentation.

** Locality and Virtual Memory
Over a short period of time, execution could be confined to a small section of a program
and so loading the full program in would be wasteful in case it is suspended.
Saves time as unused pieces are not swapped in and out of memory.

*Thrashing*: when the system spends most of its time swapping pieces rather than executing
instructions because pieces are thrown out just before they are used

*Locality*: program and data references within a process tend to cluster, used to avoid
thrashing

Locality suggests virtual memory may be effective, but this requires:
- hardware support for paging and/or segmentation
- OS includes software for manageing movement of pages and/or segments between secondary
  and main memory

** Paging
With virtual memory paging, there are equal size pages of the same length as frames but
not all pages need to be loaded into main memory frames for execution.

Virtual memory paging maintains a page table for each process, but page table entries
must have:
- a present (P) bit to indicate whether or not they are in main memory (if so
  the frame number is correct)
- a modify (M) bit to indicate whether the contents of the corresponding page have been
  altered since the page was last loaded into main memory (if so, write the page out
  on replacement)
- other control bits for protection, sharing, etc.

