3A/SE350/Virtual-Memory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-06 Wed 02:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Virtual Memory</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Virtual Memory</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org00f3789">1. Hardware and Control Structures</a>
<ul>
<li><a href="#org849b728">1.1. Virtual Memory</a></li>
<li><a href="#orgfb971aa">1.2. Locality and Virtual Memory</a></li>
<li><a href="#orgeccdcd1">1.3. Paging</a>
<ul>
<li><a href="#org7ac53ea">1.3.1. Page Table Structure</a></li>
<li><a href="#org34ce2c8">1.3.2. Inverted Page Table</a></li>
<li><a href="#org3ab1554">1.3.3. Translation Lookaside Buffer</a></li>
<li><a href="#org22e4d4a">1.3.4. Page Size</a></li>
</ul>
</li>
<li><a href="#org36d8ffa">1.4. Segmentation</a>
<ul>
<li><a href="#orgd6177de">1.4.1. Virtual Memory Implications</a></li>
<li><a href="#orgf204d52">1.4.2. Organization</a></li>
</ul>
</li>
<li><a href="#org84e403c">1.5. Combined Paging and Segmentation</a></li>
<li><a href="#orgaaa16e5">1.6. Protection and Sharing</a></li>
</ul>
</li>
<li><a href="#orgcd906e4">2. Operating System Software</a>
<ul>
<li><a href="#orgfaade7a">2.1. OS Policies for Virtual Memory</a></li>
<li><a href="#org0b3c9cd">2.2. Fetch Policy</a></li>
<li><a href="#orge501755">2.3. Placement Policy</a></li>
<li><a href="#org0f0aaa7">2.4. Replacement Policy</a>
<ul>
<li><a href="#orgdada822">2.4.1. Frame Locking</a></li>
<li><a href="#org4ae5a5b">2.4.2. Basic Algorithms</a></li>
<li><a href="#org4934c14">2.4.3. Page Buffering</a></li>
<li><a href="#org8ff1b7c">2.4.4. Replacement Policy and Cache Size</a></li>
</ul>
</li>
<li><a href="#org09f3dd9">2.5. Resident Set Management</a>
<ul>
<li><a href="#org2b2256d">2.5.1. Resident Set Size</a></li>
<li><a href="#org70d5593">2.5.2. Replacement Scope</a></li>
</ul>
</li>
<li><a href="#org234def6">2.6. Cleaning Policy</a></li>
<li><a href="#org96accc2">2.7. Load Control</a>
<ul>
<li><a href="#org5c420d3">2.7.1. Multiprogramming Level</a></li>
<li><a href="#orgdc20261">2.7.2. Process Suspension</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org00f3789" class="outline-2">
<h2 id="org00f3789"><span class="section-number-2">1.</span> Hardware and Control Structures</h2>
<div class="outline-text-2" id="text-1">
<p>
Key characteristics of paging and segmentation are:
</p>
<ol class="org-ol">
<li>All memory references within a process are logical addresses that are dynamically
translated into physical adddresses at runtime, allowing a process to be swapped
in and out of main memory (can occupy different regions of main memory at
different times)</li>
<li>A process can be broken into pieces (pages or segments) that need not be contiguous
in main memory during execution</li>
</ol>

<p>
This ultimately means that not all pages or segments of a process need to be in main
memory during execution, only the next instruction to be fetched and next data location
to be accessed must be in main memory.
</p>

<p>
As a process executes, the procesor can determine if a memory reference is in the
resident set using the page/segment table, if not it can generate an interrupt
for a memory access fault.
This blocks the process so that the OS can bring that piece of the process into
main memory using a disk IO read request.
</p>
</div>
<div id="outline-container-org849b728" class="outline-3">
<h3 id="org849b728"><span class="section-number-3">1.1.</span> Virtual Memory</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Virtual memory</b>: a storage allocation scheme in which secondary memory can be addressed
as though it were part of main memory, where addresses a program uses are different from
addresses the memory system uses to identify storage sites through translation
</p>

<p>
Amount of virtual storage is limited by the addressing scheme of the computer and the
amount of secondary memory available, not main memory.
</p>

<p>
<b>Virtual address</b>: address assigned to a location in virtual memory to allow that location
to be accessed as if it were in main memory
</p>

<p>
<b>Virtual address space</b>: virtual storage assigned to a process
</p>

<p>
<b>Address space</b> range of memory addresses available to a process
</p>

<p>
<b>Real address</b>: address of a storage location in main memory
</p>

<p>
<b>Resident set</b>: portion of a process that is in main memory
</p>

<p>
Implications of virtual memory:
</p>
<ol class="org-ol">
<li>More processes maintainted in main memory since only portions of each process are in
main memory, which more efficiently uses the processor especially with context
switching.</li>
<li>Processes can be larger than main memory so programmers do not need to worry about
the size of their program as the OS manages virtual memory based on paging or
segmentation.</li>
</ol>
</div>
</div>
<div id="outline-container-orgfb971aa" class="outline-3">
<h3 id="orgfb971aa"><span class="section-number-3">1.2.</span> Locality and Virtual Memory</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Over a short period of time, execution could be confined to a small section of a program
and so loading the full program in would be wasteful in case it is suspended.
Saves time as unused pieces are not swapped in and out of memory.
</p>

<p>
<b>Thrashing</b>: when the system spends most of its time swapping pieces rather than executing
instructions because pieces are thrown out just before they are used
</p>

<p>
<b>Locality</b>: program and data references within a process tend to cluster, used to avoid
thrashing
</p>

<p>
Locality suggests virtual memory may be effective, but this requires:
</p>
<ul class="org-ul">
<li>hardware support for paging and/or segmentation</li>
<li>OS includes software for manageing movement of pages and/or segments between secondary
and main memory</li>
</ul>
</div>
</div>
<div id="outline-container-orgeccdcd1" class="outline-3">
<h3 id="orgeccdcd1"><span class="section-number-3">1.3.</span> Paging</h3>
<div class="outline-text-3" id="text-1-3">
<p>
With virtual memory paging, there are equal size pages of the same length as frames but
not all pages need to be loaded into main memory frames for execution.
</p>

<p>
Virtual memory paging maintains a page table for each process, but page table entries
must have:
</p>
<ul class="org-ul">
<li>a present (P) bit to indicate whether or not they are in main memory (if so
the frame number is correct)</li>
<li>a modify (M) bit to indicate whether the contents of the corresponding page have been
altered since the page was last loaded into main memory (if so, write the page out
on replacement)</li>
<li>other control bits for protection, sharing, etc.</li>
</ul>
</div>
