3A/SE350/Virtual-Memory.org
*** Page Table Structure
Reading a word from memory involves the translation of a logical (virtual) address
consisting of page number and offset into a physical address with frame number
and offset using the page table.

Page table must be in main memory to be accessed.
When a process is running, a register holds the starting address of the page table
for that process.
Page number of a virtual address is used to index the table and find the frame
number which is combined with the offset of the virtual address to find the real address.

Number of pages in a process can exceed the number of frames in main memory.

If processes are allowed to have large amounts of virtual memory, memory devoted to
page tables alone could be unacceptably high.
Most virtual memory schemes store page tables in virtual memory, so page tables
are subject to paging.

When a process is running, at least the page table entry of the currently executing
page must be in memory (can be more).

Some processors use a 2-level scheme to organize large page tables:
- there is a page directory where each entry points to a page table
- the number of pages allowed for a process is the product of the number of entries
  in the page directory and the max number of entries in a page table
- max length of a page table is typically at most one page

*** Inverted Page Table
Page tables so far have size proportional to virtual address space.

Inverted page tables can be used where:
- page number of a virtual address is mapped to a hash value
- hash value is a pointer to the inverted page table which contains page table entries
- one entry in the inverted page table for each real memory page frame rather than
  one per virtual page, so page table has fixed size
- chaining may be needed because of hash

Each entry in the page table includes:
- *page number*: page number portion of virtual address
- *process identifier*: process that owns the page, where this and page number
  identifies a page within the virtual address space of a process
- *control bits*: includes flags like valid, referenced, modified, and protection and
  locking info
- *chain pointer*: null field if no chained entries, otherwise field contains index
  value of next entry in chain

*** Translation Lookaside Buffer
Every virtual memory reference is 2 physical memory accesses, one for the page table
entry and one for the desired data.
Regular virtual memory scheme would then double memory access time.

To overcome this, a special high-speed cache for page table entries called a
*translation lookaside buffer* (TLB) is used.
Contains the most recently used page table entries.

The procedure with a TLB is:
- processor first checks TLB for desired page table entry
  - if hit, frame number is retrieved and real address is formed
  - if miss, then processor uses page number to index process in page table and
    examine the corresponding page table entry
- if the P bit is set then the page is in main memory and the processor can
  get the frame number from the page table entry to form the real address
  - this also updates the TLB to include the page table entry
- if the P bit is not set, a page fault occurs and the OS is invoked to load the
  page and update the page table

Since the TLB only contains some entries in a full page table, each entry in the TLB
must include the page number and the complete page table entry.
Hardware allows a number of TLB entries to be checked simultaneously to check if there
is a page number match, called *associative mapping*.

TLB design relies on hardware cache design and this must consider the way in which
entries are organized and replacement policy.

Virtual memory must interact with main memory cache.
Once the real address is generated, it is in the form of a tag and the remainder,
which the cache uses to check if the block containing that word is present.
If so, it is returned, and if not, the word is retrieved from main memory.

