3A/SE350/Virtual-Memory.html
<div id="outline-container-org7ac53ea" class="outline-4">
<h4 id="org7ac53ea"><span class="section-number-4">1.3.1.</span> Page Table Structure</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Reading a word from memory involves the translation of a logical (virtual) address
consisting of page number and offset into a physical address with frame number
and offset using the page table.
</p>

<p>
Page table must be in main memory to be accessed.
When a process is running, a register holds the starting address of the page table
for that process.
Page number of a virtual address is used to index the table and find the frame
number which is combined with the offset of the virtual address to find the real address.
</p>

<p>
Number of pages in a process can exceed the number of frames in main memory.
</p>

<p>
If processes are allowed to have large amounts of virtual memory, memory devoted to
page tables alone could be unacceptably high.
Most virtual memory schemes store page tables in virtual memory, so page tables
are subject to paging.
</p>

<p>
When a process is running, at least the page table entry of the currently executing
page must be in memory (can be more).
</p>

<p>
Some processors use a 2-level scheme to organize large page tables:
</p>
<ul class="org-ul">
<li>there is a page directory where each entry points to a page table</li>
<li>the number of pages allowed for a process is the product of the number of entries
in the page directory and the max number of entries in a page table</li>
<li>max length of a page table is typically at most one page</li>
</ul>
</div>
</div>
<div id="outline-container-org34ce2c8" class="outline-4">
<h4 id="org34ce2c8"><span class="section-number-4">1.3.2.</span> Inverted Page Table</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Page tables so far have size proportional to virtual address space.
</p>

<p>
Inverted page tables can be used where:
</p>
<ul class="org-ul">
<li>page number of a virtual address is mapped to a hash value</li>
<li>hash value is a pointer to the inverted page table which contains page table entries</li>
<li>one entry in the inverted page table for each real memory page frame rather than
one per virtual page, so page table has fixed size</li>
<li>chaining may be needed because of hash</li>
</ul>

<p>
Each entry in the page table includes:
</p>
<ul class="org-ul">
<li><b>page number</b>: page number portion of virtual address</li>
<li><b>process identifier</b>: process that owns the page, where this and page number
identifies a page within the virtual address space of a process</li>
<li><b>control bits</b>: includes flags like valid, referenced, modified, and protection and
locking info</li>
<li><b>chain pointer</b>: null field if no chained entries, otherwise field contains index
value of next entry in chain</li>
</ul>
</div>
</div>
<div id="outline-container-org3ab1554" class="outline-4">
<h4 id="org3ab1554"><span class="section-number-4">1.3.3.</span> Translation Lookaside Buffer</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Every virtual memory reference is 2 physical memory accesses, one for the page table
entry and one for the desired data.
Regular virtual memory scheme would then double memory access time.
</p>

<p>
To overcome this, a special high-speed cache for page table entries called a
<b>translation lookaside buffer</b> (TLB) is used.
Contains the most recently used page table entries.
</p>

<p>
The procedure with a TLB is:
</p>
<ul class="org-ul">
<li>processor first checks TLB for desired page table entry
<ul class="org-ul">
<li>if hit, frame number is retrieved and real address is formed</li>
<li>if miss, then processor uses page number to index process in page table and
examine the corresponding page table entry</li>
</ul></li>
<li>if the P bit is set then the page is in main memory and the processor can
get the frame number from the page table entry to form the real address
<ul class="org-ul">
<li>this also updates the TLB to include the page table entry</li>
</ul></li>
<li>if the P bit is not set, a page fault occurs and the OS is invoked to load the
page and update the page table</li>
</ul>

<p>
Since the TLB only contains some entries in a full page table, each entry in the TLB
must include the page number and the complete page table entry.
Hardware allows a number of TLB entries to be checked simultaneously to check if there
is a page number match, called <b>associative mapping</b>.
</p>

<p>
TLB design relies on hardware cache design and this must consider the way in which
entries are organized and replacement policy.
</p>

<p>
Virtual memory must interact with main memory cache.
Once the real address is generated, it is in the form of a tag and the remainder,
which the cache uses to check if the block containing that word is present.
If so, it is returned, and if not, the word is retrieved from main memory.
</p>
</div>
</div>
