3A/SE350/Virtual-Memory.org
*** Page Size
Factors to consider:
- *internal fragmentation*: smaller the pages, less internal fragmentation
- *pages per process*: smaller the pages, more pages per process and larger page
  tables
  - can result in double page fault to bring portion of page table, and then process page
- *physical characteristics*: most secondary-memory are rotational and favour a larger
  page size for more efficient block transfer of data

If page size is very small, many pages will be in memory near recent references keeping
page fault rate low.
As page size increases, each individual page contains locations further from recent
references, so less locality and page fault rate rises.
As the page size approaches the size of the process, page fault rate falls.

Page fault rate is also determined by the number of frames allocated to a process,
and this falls as the number of pages in main memory grows.

As main memory grows, address space used by programs does as well.
Programming techniques can avoid locality, such as:
- OOP which encourages using many small programs data modules scattered over
  many objects
- multithreaded applications which can have abrupt changes in instructions and
  scattered memory references

For given TLB size, as memory size of processes grows and locality decreases,
hit ratio of TLB accesses decreases, so TLB can be a bottleneck.
Larger TLB can help or larger page sizes so that each page table entry refers
to a larger block of memory.

Multiple page sizes can be used which provides flexibility in using a TLB effectively.
Most OSs only support one page size.

** Segmentation
*** Virtual Memory Implications
Segmentation allows memory to be viewed as consisting of agments of unequal, dynamic size.
Memory references consist of a segment number and offset.

Advantages to the programmer:
1. simplifies handling growing data structures as they can be assigned a segment whose
   size changes dynamically and can be swapped out of main memory if required
2. allows programs to be altered and recompiled independently without requiring all
   to be relinked and reloaded using multiple segments
3. allows sharing among processes as a utility or useful data can be placed in a segment
   that can be referenced by other processes
4. allows protection as segments can be constructed to contain a well-defined set of
   programs or data that the program or admin can assign privileges

*** Organization
A unique segment table is associated with each process.

Segment table entries include:
- a bit to indicate if the segment is in memory (if so,
  starting address and length are valid)
- a modify bit to indicate whether the contents have been altered since the segment was
  loaded into main memory (if so, weite the segment out to disk)
- other control bits for protection and sharing

Segment table must be in main memory to be accessed.
A register holds the starting address of the segment table for the running process.

** Combined Paging and Segmentation
Paging is transparent to the programmer, eliminates external framentation (efficient
memory use), can develop sophisticated memory management algorithms to exploit the
behaviour of programs because of equal size.

Segmentation is visible to the programmer, handles growing data structures, modularity,
and support for sharing and prtection.

Some processors and OS use both for both benefits.

In combined paging/segmentation, address space is broken into segments (by the
programmer) that are broken into fixed-size pages.
If a segment is smaller than a page, it occupies one page.

Logical address (for system) contains a segment number, page number, and offset.
Each process has a segment table and many page tables (one for each process segment).

Procedure:
- with the virtual address, the processor uses the segment number to index into the
  process segment table and find the page table
- then the page number portion is used to index the page table and look up the
  corresponding frame number
- this is combined with offset to give a real address

