3A/SE350/Virtual-Memory.html
<div id="outline-container-org22e4d4a" class="outline-4">
<h4 id="org22e4d4a"><span class="section-number-4">1.3.4.</span> Page Size</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Factors to consider:
</p>
<ul class="org-ul">
<li><b>internal fragmentation</b>: smaller the pages, less internal fragmentation</li>
<li><b>pages per process</b>: smaller the pages, more pages per process and larger page
tables
<ul class="org-ul">
<li>can result in double page fault to bring portion of page table, and then process page</li>
</ul></li>
<li><b>physical characteristics</b>: most secondary-memory are rotational and favour a larger
page size for more efficient block transfer of data</li>
</ul>

<p>
If page size is very small, many pages will be in memory near recent references keeping
page fault rate low.
As page size increases, each individual page contains locations further from recent
references, so less locality and page fault rate rises.
As the page size approaches the size of the process, page fault rate falls.
</p>

<p>
Page fault rate is also determined by the number of frames allocated to a process,
and this falls as the number of pages in main memory grows.
</p>

<p>
As main memory grows, address space used by programs does as well.
Programming techniques can avoid locality, such as:
</p>
<ul class="org-ul">
<li>OOP which encourages using many small programs data modules scattered over
many objects</li>
<li>multithreaded applications which can have abrupt changes in instructions and
scattered memory references</li>
</ul>

<p>
For given TLB size, as memory size of processes grows and locality decreases,
hit ratio of TLB accesses decreases, so TLB can be a bottleneck.
Larger TLB can help or larger page sizes so that each page table entry refers
to a larger block of memory.
</p>

<p>
Multiple page sizes can be used which provides flexibility in using a TLB effectively.
Most OSs only support one page size.
</p>
</div>
</div>
</div>
<div id="outline-container-org36d8ffa" class="outline-3">
<h3 id="org36d8ffa"><span class="section-number-3">1.4.</span> Segmentation</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgd6177de" class="outline-4">
<h4 id="orgd6177de"><span class="section-number-4">1.4.1.</span> Virtual Memory Implications</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Segmentation allows memory to be viewed as consisting of agments of unequal, dynamic size.
Memory references consist of a segment number and offset.
</p>

<p>
Advantages to the programmer:
</p>
<ol class="org-ol">
<li>simplifies handling growing data structures as they can be assigned a segment whose
size changes dynamically and can be swapped out of main memory if required</li>
<li>allows programs to be altered and recompiled independently without requiring all
to be relinked and reloaded using multiple segments</li>
<li>allows sharing among processes as a utility or useful data can be placed in a segment
that can be referenced by other processes</li>
<li>allows protection as segments can be constructed to contain a well-defined set of
programs or data that the program or admin can assign privileges</li>
</ol>
</div>
</div>
<div id="outline-container-orgf204d52" class="outline-4">
<h4 id="orgf204d52"><span class="section-number-4">1.4.2.</span> Organization</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
A unique segment table is associated with each process.
</p>

<p>
Segment table entries include:
</p>
<ul class="org-ul">
<li>a bit to indicate if the segment is in memory (if so,
starting address and length are valid)</li>
<li>a modify bit to indicate whether the contents have been altered since the segment was
loaded into main memory (if so, weite the segment out to disk)</li>
<li>other control bits for protection and sharing</li>
</ul>

<p>
Segment table must be in main memory to be accessed.
A register holds the starting address of the segment table for the running process.
</p>
</div>
</div>
</div>
<div id="outline-container-org84e403c" class="outline-3">
<h3 id="org84e403c"><span class="section-number-3">1.5.</span> Combined Paging and Segmentation</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Paging is transparent to the programmer, eliminates external framentation (efficient
memory use), can develop sophisticated memory management algorithms to exploit the
behaviour of programs because of equal size.
</p>

<p>
Segmentation is visible to the programmer, handles growing data structures, modularity,
and support for sharing and prtection.
</p>

<p>
Some processors and OS use both for both benefits.
</p>

<p>
In combined paging/segmentation, address space is broken into segments (by the
programmer) that are broken into fixed-size pages.
If a segment is smaller than a page, it occupies one page.
</p>

<p>
Logical address (for system) contains a segment number, page number, and offset.
Each process has a segment table and many page tables (one for each process segment).
</p>

<p>
Procedure:
</p>
<ul class="org-ul">
<li>with the virtual address, the processor uses the segment number to index into the
process segment table and find the page table</li>
<li>then the page number portion is used to index the page table and look up the
corresponding frame number</li>
<li>this is combined with offset to give a real address</li>
</ul>
</div>
</div>
