3A/SE350/Virtual-Memory.org
** Protection and Sharing
Segmentation allows for protection and sharing policies.

Since each segment table entry includes length and base address, a program cannot
access a main memory location beyond the segment limits.

For sharing, a segment can be referenced in the segment tables of multiple processes.

Same mechanisms available for paging, but specification is difficult since pages not
visible to programmer.

A ring-protection structure can be used where inner rings enjoy greater privilege.
A program can only access data on the same or outer rings.
A program can call services on the same or inner rings.

* Operating System Software
OS memory management design depends on:
1. whether or not to use virtual memory
2. use of paging, segmentation, or both
3. algorithms used for various aspects of memory management

Virtual memory and paging/segmentation depend on available hardware.
Outside of older PC OSs, all provide virtual memory and pure segmentation is rate.

Key issue is performance by minimizing page fault rate to reduce overhead.

While process switching during page fetch, would like to arrange so that when
process is executing, probability of finding a missing page is minimized.

** OS Policies for Virtual Memory
- *Fetch policy*: demand paging or prepaging
- *Placement policy*
- *Replacement policy*: basic are optimal, LRU, FIFO, clock, and non-basic is page
  buffering
- *Resident Set Management*: resident set size is either fixed or variable, replacement
  scope is either global or locality
- *Cleaning Policy*: demand or precleaning
- *Load Control*: degree of multiprogramming

Performance of any set of policies depends on:
- main memory size
- relative speed of main and secondary emmory
- size and number of processes competing for resources
- execution behaviour of individual programs, depends on nature of applications,
  programming languages, compiler, style of programmer, and user behaviour

** Fetch Policy
Determines when a page should be brought into main memory.

*Demand paging*: a page is brought into main memory only when a reference is made to a
locations on that page

This causes:
- many page faults on process start
- as more pages on main memory, page faults drop to a very low level

*Prepaging*: pages other than the one demanded by a page fault are brought in, such as
contiguous pages

This is ineffective is most extra pages are not referenced.
Can be employed when a process started (programmer defines desired pages) or when a page
fault occurs (invisible to programmer).

** Placement Policy
Determines where in real memory a process piece is to reside.

Already discussed for pure segmentation, but for pure paging or paging/segmentation,
placement is usually irrelevant since address translation hardware and main memory
access hardware can perform functions for any page-frame combo with equal efficiency.

Important for NUMA (nonuniform memory access) multiprocessor as memory can be
referenced by any processor on the machine but acess time for a physical location
varies with distance between processor and memory.
For NUMA, automatic placement strategy is desirable to assign pages to memory that
provide the best performance.

** Replacement Policy
Deals with the selection of a page in main memory to be replaced when a new page is
brought in.

Related to:
- number of page frames allocated per active process
- if set of pages for replacement should be limited to the process that caused the
  page fault or encompass all page frames in main memory
- among set of pages considered, which page should be selected for replacement

First 2 are resident set management, 3rd is replacement policy.

The more elaborate and sophisticated the replacement policy, the greater the
hardware and software overhead to implement it.

*** Frame Locking
Some frames can be locked, where the page stored in that frame cannot be replaced.

Examples include the kernel, key control structures, IO buffers, and time critical
areas that are locked into main memory frames.

Achieved by associating a lock bit with each frame that is in the frame table
or in the current page table.

