3A/SE350/Virtual-Memory.html
<div id="outline-container-orgaaa16e5" class="outline-3">
<h3 id="orgaaa16e5"><span class="section-number-3">1.6.</span> Protection and Sharing</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Segmentation allows for protection and sharing policies.
</p>

<p>
Since each segment table entry includes length and base address, a program cannot
access a main memory location beyond the segment limits.
</p>

<p>
For sharing, a segment can be referenced in the segment tables of multiple processes.
</p>

<p>
Same mechanisms available for paging, but specification is difficult since pages not
visible to programmer.
</p>

<p>
A ring-protection structure can be used where inner rings enjoy greater privilege.
A program can only access data on the same or outer rings.
A program can call services on the same or inner rings.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd906e4" class="outline-2">
<h2 id="orgcd906e4"><span class="section-number-2">2.</span> Operating System Software</h2>
<div class="outline-text-2" id="text-2">
<p>
OS memory management design depends on:
</p>
<ol class="org-ol">
<li>whether or not to use virtual memory</li>
<li>use of paging, segmentation, or both</li>
<li>algorithms used for various aspects of memory management</li>
</ol>

<p>
Virtual memory and paging/segmentation depend on available hardware.
Outside of older PC OSs, all provide virtual memory and pure segmentation is rate.
</p>

<p>
Key issue is performance by minimizing page fault rate to reduce overhead.
</p>

<p>
While process switching during page fetch, would like to arrange so that when
process is executing, probability of finding a missing page is minimized.
</p>
</div>
<div id="outline-container-orgfaade7a" class="outline-3">
<h3 id="orgfaade7a"><span class="section-number-3">2.1.</span> OS Policies for Virtual Memory</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>Fetch policy</b>: demand paging or prepaging</li>
<li><b>Placement policy</b></li>
<li><b>Replacement policy</b>: basic are optimal, LRU, FIFO, clock, and non-basic is page
buffering</li>
<li><b>Resident Set Management</b>: resident set size is either fixed or variable, replacement
scope is either global or locality</li>
<li><b>Cleaning Policy</b>: demand or precleaning</li>
<li><b>Load Control</b>: degree of multiprogramming</li>
</ul>

<p>
Performance of any set of policies depends on:
</p>
<ul class="org-ul">
<li>main memory size</li>
<li>relative speed of main and secondary emmory</li>
<li>size and number of processes competing for resources</li>
<li>execution behaviour of individual programs, depends on nature of applications,
programming languages, compiler, style of programmer, and user behaviour</li>
</ul>
</div>
</div>
<div id="outline-container-org0b3c9cd" class="outline-3">
<h3 id="org0b3c9cd"><span class="section-number-3">2.2.</span> Fetch Policy</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Determines when a page should be brought into main memory.
</p>

<p>
<b>Demand paging</b>: a page is brought into main memory only when a reference is made to a
locations on that page
</p>

<p>
This causes:
</p>
<ul class="org-ul">
<li>many page faults on process start</li>
<li>as more pages on main memory, page faults drop to a very low level</li>
</ul>

<p>
<b>Prepaging</b>: pages other than the one demanded by a page fault are brought in, such as
contiguous pages
</p>

<p>
This is ineffective is most extra pages are not referenced.
Can be employed when a process started (programmer defines desired pages) or when a page
fault occurs (invisible to programmer).
</p>
</div>
</div>
<div id="outline-container-orge501755" class="outline-3">
<h3 id="orge501755"><span class="section-number-3">2.3.</span> Placement Policy</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Determines where in real memory a process piece is to reside.
</p>

<p>
Already discussed for pure segmentation, but for pure paging or paging/segmentation,
placement is usually irrelevant since address translation hardware and main memory
access hardware can perform functions for any page-frame combo with equal efficiency.
</p>

<p>
Important for NUMA (nonuniform memory access) multiprocessor as memory can be
referenced by any processor on the machine but acess time for a physical location
varies with distance between processor and memory.
For NUMA, automatic placement strategy is desirable to assign pages to memory that
provide the best performance.
</p>
</div>
</div>
<div id="outline-container-org0f0aaa7" class="outline-3">
<h3 id="org0f0aaa7"><span class="section-number-3">2.4.</span> Replacement Policy</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Deals with the selection of a page in main memory to be replaced when a new page is
brought in.
</p>

<p>
Related to:
</p>
<ul class="org-ul">
<li>number of page frames allocated per active process</li>
<li>if set of pages for replacement should be limited to the process that caused the
page fault or encompass all page frames in main memory</li>
<li>among set of pages considered, which page should be selected for replacement</li>
</ul>

<p>
First 2 are resident set management, 3rd is replacement policy.
</p>

<p>
The more elaborate and sophisticated the replacement policy, the greater the
hardware and software overhead to implement it.
</p>
</div>
<div id="outline-container-orgdada822" class="outline-4">
<h4 id="orgdada822"><span class="section-number-4">2.4.1.</span> Frame Locking</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Some frames can be locked, where the page stored in that frame cannot be replaced.
</p>

<p>
Examples include the kernel, key control structures, IO buffers, and time critical
areas that are locked into main memory frames.
</p>

<p>
Achieved by associating a lock bit with each frame that is in the frame table
or in the current page table.
</p>
</div>
</div>
