3A/SE350/Virtual-Memory.tex
\subsection{Protection and Sharing}
\label{sec:org270958e}
Segmentation allows for protection and sharing policies.

Since each segment table entry includes length and base address, a program cannot
access a main memory location beyond the segment limits.

For sharing, a segment can be referenced in the segment tables of multiple processes.

Same mechanisms available for paging, but specification is difficult since pages not
visible to programmer.

A ring-protection structure can be used where inner rings enjoy greater privilege.
A program can only access data on the same or outer rings.
A program can call services on the same or inner rings.
\section{Operating System Software}
\label{sec:org2430553}
OS memory management design depends on:
\begin{enumerate}
\item whether or not to use virtual memory
\item use of paging, segmentation, or both
\item algorithms used for various aspects of memory management
\end{enumerate}

Virtual memory and paging/segmentation depend on available hardware.
Outside of older PC OSs, all provide virtual memory and pure segmentation is rate.

Key issue is performance by minimizing page fault rate to reduce overhead.

While process switching during page fetch, would like to arrange so that when
process is executing, probability of finding a missing page is minimized.
\subsection{OS Policies for Virtual Memory}
\label{sec:org8fca0ac}
\begin{itemize}
\item \textbf{Fetch policy}: demand paging or prepaging
\item \textbf{Placement policy}
\item \textbf{Replacement policy}: basic are optimal, LRU, FIFO, clock, and non-basic is page
buffering
\item \textbf{Resident Set Management}: resident set size is either fixed or variable, replacement
scope is either global or locality
\item \textbf{Cleaning Policy}: demand or precleaning
\item \textbf{Load Control}: degree of multiprogramming
\end{itemize}

Performance of any set of policies depends on:
\begin{itemize}
\item main memory size
\item relative speed of main and secondary emmory
\item size and number of processes competing for resources
\item execution behaviour of individual programs, depends on nature of applications,
programming languages, compiler, style of programmer, and user behaviour
\end{itemize}
\subsection{Fetch Policy}
\label{sec:org9be5f21}
Determines when a page should be brought into main memory.

\textbf{Demand paging}: a page is brought into main memory only when a reference is made to a
locations on that page

This causes:
\begin{itemize}
\item many page faults on process start
\item as more pages on main memory, page faults drop to a very low level
\end{itemize}

\textbf{Prepaging}: pages other than the one demanded by a page fault are brought in, such as
contiguous pages

This is ineffective is most extra pages are not referenced.
Can be employed when a process started (programmer defines desired pages) or when a page
fault occurs (invisible to programmer).
\subsection{Placement Policy}
\label{sec:orgfa7d5d0}
Determines where in real memory a process piece is to reside.

Already discussed for pure segmentation, but for pure paging or paging/segmentation,
placement is usually irrelevant since address translation hardware and main memory
access hardware can perform functions for any page-frame combo with equal efficiency.

Important for NUMA (nonuniform memory access) multiprocessor as memory can be
referenced by any processor on the machine but acess time for a physical location
varies with distance between processor and memory.
For NUMA, automatic placement strategy is desirable to assign pages to memory that
provide the best performance.
\subsection{Replacement Policy}
\label{sec:org61ee788}
Deals with the selection of a page in main memory to be replaced when a new page is
brought in.

Related to:
\begin{itemize}
\item number of page frames allocated per active process
\item if set of pages for replacement should be limited to the process that caused the
page fault or encompass all page frames in main memory
\item among set of pages considered, which page should be selected for replacement
\end{itemize}

First 2 are resident set management, 3rd is replacement policy.

The more elaborate and sophisticated the replacement policy, the greater the
hardware and software overhead to implement it.
\subsubsection{Frame Locking}
\label{sec:org0d18fc1}
Some frames can be locked, where the page stored in that frame cannot be replaced.

Examples include the kernel, key control structures, IO buffers, and time critical
areas that are locked into main memory frames.

Achieved by associating a lock bit with each frame that is in the frame table
or in the current page table.
