3A/SE350/Virtual-Memory.html
<div id="outline-container-org4ae5a5b" class="outline-4">
<h4 id="org4ae5a5b"><span class="section-number-4">2.4.2.</span> Basic Algorithms</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
<b>Optimal</b> selects for replacing the page for which the time to the next
reference is the longest, though impossible to implement and just a judge
against real algorithms
</p>

<p>
<b>Least Recently Used (LRU)</b> replaces the page in memory that has not been
referenced by the longest time.
</p>
<ul class="org-ul">
<li>works by locality since that page is least likely to be used again in the near
future</li>
<li>does nearly as well as optimaly, but difficult to implement
<ul class="org-ul">
<li>could tag each page with time of last reference but too much overhead</li>
<li>could maintain a stack of page references, but expensive</li>
</ul></li>
</ul>

<p>
<b>First-In-First-Out (FIFO)</b> treats page frames as a circular buffer and pages
are removed for a process in round-robin style
</p>
<ul class="org-ul">
<li>only requires a pointer that circles through page frames of a process</li>
<li>simple to implement</li>
<li>does not work well if regions of program are heavily used throughout life
of a program</li>
</ul>

<p>
<b>Clock policy</b> requires association of an additional bit with each frame (use
bit)
</p>
<ul class="org-ul">
<li>when a page is loaded into a frame in memory and on each reference,
use bit is set to 1</li>
<li>for page replacement, the set of frames that are candidates for replacement is a
circular buffer with an associated pointer
<ul class="org-ul">
<li>when a page is replaced, pointer indicates next frame in the buffer after
the last one updated</li>
<li>when replacing a page, OS scans a buffer to find a frame with use bit 0</li>
<li>when a frame with use bit 1 is found, it is reset to 0</li>
</ul></li>
<li>similar to FIFO except that any frame with use bit 1 is passed over</li>
<li>can be made more powerful by increasing the number of bits it employs such
as a modify bit associated with each page in main memory
<ul class="org-ul">
<li>works by ensuring a page is not replaced until it has been written back
into secondary memory</li>
</ul></li>
<li>with the <span class="underline">use</span> and <span class="underline">modify</span> bits, each frame falls into:
<ul class="org-ul">
<li>not accessed recently, not modified</li>
<li>accessed recently, not modified</li>
<li>not accessed recently, modified</li>
<li>accessed recently, modified</li>
</ul></li>
<li>then the clock algorithm works as:
<ul class="org-ul">
<li>begin at the current position of the pointer, scan the frame buffer and do
not change the use bit, first frame with use and modify both 0 is selected
for replacement</li>
<li>if this is not possible, look for a frame with use bit 0 and modify bit 1,
but on this scan set the use bit to 0 on each frame bypassed</li>
<li>if this is not possible, the pointer returns to the original position and all
frames in the set have use bit 0, so go back to 1st step</li>
</ul></li>
<li>this new algorithm is better since is avoids writing back if not needed
and by locality, finds a page that will likely not be needed again soon</li>
</ul>

<p>
Other than optimal, order of least page fault rate is LRU, clock, FIFO.
Small factor differences can have a noticeable effect on main memory requirements
(to avoid degrading OS performance) or OS performance (to avoid enlarging main
memory).
</p>
</div>
</div>
<div id="outline-container-org4934c14" class="outline-4">
<h4 id="org4934c14"><span class="section-number-4">2.4.3.</span> Page Buffering</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Cost of replacing a page that has been modified is greater
than for one that has not, due to write back.
</p>

<p>
<b>Page buffering</b>: uses FIFO for replacement but to improve performance the replaced
page is assigned to the free page list if it has not been modified or the modified
page list if so
</p>
<ul class="org-ul">
<li>page not physically moved in main memory but entry in page table is placed in
the corresponding list on replace</li>
</ul>

<p>
<b>Free page list</b>: for page frames available for reading in pages, where a small
number of frames are free at all times
</p>
<ul class="org-ul">
<li>when a page is read in, the page frame at the head of the free page list is
used, and this destroys the page there</li>
<li>the unmodified page remains in memory and its page frame is added to the tail
of the free page list</li>
</ul>

<p>
When a modified page is to be written out and replaced, its page frame is added
to the tail of the modified page list.
</p>

<p>
The page to be replaced remains in memory, so if the page is referenced again
it can be returned to the resident set at low cost.
</p>

<p>
Since modified pages are written out in clusters, this significantly reduces the
number of IO operations and the amount of disk access time.
</p>
</div>
</div>
<div id="outline-container-org8ff1b7c" class="outline-4">
<h4 id="org8ff1b7c"><span class="section-number-4">2.4.4.</span> Replacement Policy and Cache Size</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
With larger caches, the replacement of virtual memory pages can have a
performance impact as cache blocks for pages are lost on replacement as well.
</p>

<p>
With page buffering, it is possible to improve cache performance by using a page
placement policy in the page buffer (rather than page replacement).
</p>

<p>
Essence of these strategies is to bring consecutive pages into main memory in a way
to minimize the number of page frames mapped into the same cache slots.
</p>
</div>
</div>
</div>
