3A/SE350/Virtual-Memory.tex
\subsubsection{Basic Algorithms}
\label{sec:orga6e528c}
\textbf{Optimal} selects for replacing the page for which the time to the next
reference is the longest, though impossible to implement and just a judge
against real algorithms

\textbf{Least Recently Used (LRU)} replaces the page in memory that has not been
referenced by the longest time.
\begin{itemize}
\item works by locality since that page is least likely to be used again in the near
future
\item does nearly as well as optimaly, but difficult to implement
\begin{itemize}
\item could tag each page with time of last reference but too much overhead
\item could maintain a stack of page references, but expensive
\end{itemize}
\end{itemize}

\textbf{First-In-First-Out (FIFO)} treats page frames as a circular buffer and pages
are removed for a process in round-robin style
\begin{itemize}
\item only requires a pointer that circles through page frames of a process
\item simple to implement
\item does not work well if regions of program are heavily used throughout life
of a program
\end{itemize}

\textbf{Clock policy} requires association of an additional bit with each frame (use
bit)
\begin{itemize}
\item when a page is loaded into a frame in memory and on each reference,
use bit is set to 1
\item for page replacement, the set of frames that are candidates for replacement is a
circular buffer with an associated pointer
\begin{itemize}
\item when a page is replaced, pointer indicates next frame in the buffer after
the last one updated
\item when replacing a page, OS scans a buffer to find a frame with use bit 0
\item when a frame with use bit 1 is found, it is reset to 0
\end{itemize}
\item similar to FIFO except that any frame with use bit 1 is passed over
\item can be made more powerful by increasing the number of bits it employs such
as a modify bit associated with each page in main memory
\begin{itemize}
\item works by ensuring a page is not replaced until it has been written back
into secondary memory
\end{itemize}
\item with the \uline{use} and \uline{modify} bits, each frame falls into:
\begin{itemize}
\item not accessed recently, not modified
\item accessed recently, not modified
\item not accessed recently, modified
\item accessed recently, modified
\end{itemize}
\item then the clock algorithm works as:
\begin{itemize}
\item begin at the current position of the pointer, scan the frame buffer and do
not change the use bit, first frame with use and modify both 0 is selected
for replacement
\item if this is not possible, look for a frame with use bit 0 and modify bit 1,
but on this scan set the use bit to 0 on each frame bypassed
\item if this is not possible, the pointer returns to the original position and all
frames in the set have use bit 0, so go back to 1st step
\end{itemize}
\item this new algorithm is better since is avoids writing back if not needed
and by locality, finds a page that will likely not be needed again soon
\end{itemize}

Other than optimal, order of least page fault rate is LRU, clock, FIFO.
Small factor differences can have a noticeable effect on main memory requirements
(to avoid degrading OS performance) or OS performance (to avoid enlarging main
memory).
\subsubsection{Page Buffering}
\label{sec:org83639b0}
Cost of replacing a page that has been modified is greater
than for one that has not, due to write back.

\textbf{Page buffering}: uses FIFO for replacement but to improve performance the replaced
page is assigned to the free page list if it has not been modified or the modified
page list if so
\begin{itemize}
\item page not physically moved in main memory but entry in page table is placed in
the corresponding list on replace
\end{itemize}

\textbf{Free page list}: for page frames available for reading in pages, where a small
number of frames are free at all times
\begin{itemize}
\item when a page is read in, the page frame at the head of the free page list is
used, and this destroys the page there
\item the unmodified page remains in memory and its page frame is added to the tail
of the free page list
\end{itemize}

When a modified page is to be written out and replaced, its page frame is added
to the tail of the modified page list.

The page to be replaced remains in memory, so if the page is referenced again
it can be returned to the resident set at low cost.

Since modified pages are written out in clusters, this significantly reduces the
number of IO operations and the amount of disk access time.
\subsubsection{Replacement Policy and Cache Size}
\label{sec:org963402c}
With larger caches, the replacement of virtual memory pages can have a
performance impact as cache blocks for pages are lost on replacement as well.

With page buffering, it is possible to improve cache performance by using a page
placement policy in the page buffer (rather than page replacement).

Essence of these strategies is to bring consecutive pages into main memory in a way
to minimize the number of page frames mapped into the same cache slots.
