3A/SE350/Virtual-Memory.org
*** Resident Set Size
With paged virtual memory, not all pages of a process need to be in main memory.
OS must decide how many pages to bring in.

Factors to decide this:
- less memory per process means more processes in main memory, so higher probability
  that OS will find at least one ready process so less time lost to swapping
- if a small number of pages of a process are in main memory, more page fualts
- beyond a certain size, more main memory allocation for a process has no
  noticeable effect on page fault rate for that process

*Fixed-allocation Policy*: gives a process a fixed number of frames in main memory
within which to execute
- number decided at process creation and depends on type of process or programmer
- when a page fault occurs, one page of that process must be replaced by the needed
  page

*Variable-allocation Policy*: number of page frames allocated to a process is
varied over process lifetime
- if many page faults, then more page frames and vice versa
- relates to the concept of replacement scope
- requires more software overhead

*** Replacement Scope
Both policies activated by a page fault when there are no free page frames.

*Local replacement policy*: chooses only among resident pages of a process that
generated the page fault in selecting a page to replace

*Global replacement policy*: considers all unlocked pages in main memory as
candidates for replacement, regardless of ownership

No difference in performance, but local easier to analyze and global easier to
implement.

Fixed-resident set implies local replacement, otherwise not fixed size.

Variable-allocation can be either local or global.

**** Fixed Allocation, Local Scope
A process running in main memory has a fixed number of frames and on a page
fault the page to be replaced is from the currently resident pages for the
process.

Amount of allocation given to process is decided based on type of application
and amount requested by the program.

If too little allocated, high page fault rate, if too much allocated, too few
programs in main memory so too much swapping.

**** Variable Allocation, Global Scope
Easiest to implement.

OS maintains a list of free frames, and when a page fault occurs, a free frame is
added to the resident set of a process and the page is brought in.

A process experiencing page faults grows in size which reduces page faults.

Replacement selection is made from all frames in memory, so the process that
suffers the reduction is resident set size may not be optimum.

To counter potential performance problems, use page buffering so that the choice
of which page to replace is less significant as the page can be reclaimed if
referenced before the next block of pages are overwritten.

**** Variable Allocation, Local Scope
Overcomes problems of global-scope.

Strategy is:
1. when a new process is loaded into main memory, allocate to it a certain
   number of page frames as its resident set based on application type, program
   request or other criteria, with prepaging or demand paging to fill the
   allocation
2. when a page fault occurs, select the page to replace from among the resident
   set of the process that suffers the fault
3. from time to time, reevaluate the allocation provided to the process and
   increase/decrease it to improve overall performance

With this, changes to resident set size are deliberate and based on the likely
future demands of active processes.

More complex but better performance.
Key elements are criteria used to determine resident set size and timing of
changes.

*Working set strategy*: set of pages of a process that have been referenced
in the last $t$ logical time units

For many programs, periods of stable working set sizes alternate with periods of
rapid change.
Processes begin transient, then go back and forth between stability and transition.

Strategy for resident set size:
1. monitor the working set of each process
2. periodically remove from the resident set of a process pages that are not in
   its working set, basically LRU
3. a process may execute only if its working set is in main memory

This exploits locality to minimize page faults.

Problems with working set strategy:
1. past does not always predict future, so size and membership of working set will
   change over time
2. true measurement of working set for each process is impractical, as this would
   require timestamps and time-ordered queue of pages
3. optimal value of $t$ is unknown and would vary

Real implementations monitor page fault rate rather than working set directly.
Page fault rate low means smaller resident set, and vice versa.

