3A/SE350/Virtual-Memory.html
<div id="outline-container-org09f3dd9" class="outline-3">
<h3 id="org09f3dd9"><span class="section-number-3">2.5.</span> Resident Set Management</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org2b2256d" class="outline-4">
<h4 id="org2b2256d"><span class="section-number-4">2.5.1.</span> Resident Set Size</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
With paged virtual memory, not all pages of a process need to be in main memory.
OS must decide how many pages to bring in.
</p>

<p>
Factors to decide this:
</p>
<ul class="org-ul">
<li>less memory per process means more processes in main memory, so higher probability
that OS will find at least one ready process so less time lost to swapping</li>
<li>if a small number of pages of a process are in main memory, more page fualts</li>
<li>beyond a certain size, more main memory allocation for a process has no
noticeable effect on page fault rate for that process</li>
</ul>

<p>
<b>Fixed-allocation Policy</b>: gives a process a fixed number of frames in main memory
within which to execute
</p>
<ul class="org-ul">
<li>number decided at process creation and depends on type of process or programmer</li>
<li>when a page fault occurs, one page of that process must be replaced by the needed
page</li>
</ul>

<p>
<b>Variable-allocation Policy</b>: number of page frames allocated to a process is
varied over process lifetime
</p>
<ul class="org-ul">
<li>if many page faults, then more page frames and vice versa</li>
<li>relates to the concept of replacement scope</li>
<li>requires more software overhead</li>
</ul>
</div>
</div>
<div id="outline-container-org70d5593" class="outline-4">
<h4 id="org70d5593"><span class="section-number-4">2.5.2.</span> Replacement Scope</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Both policies activated by a page fault when there are no free page frames.
</p>

<p>
<b>Local replacement policy</b>: chooses only among resident pages of a process that
generated the page fault in selecting a page to replace
</p>

<p>
<b>Global replacement policy</b>: considers all unlocked pages in main memory as
candidates for replacement, regardless of ownership
</p>

<p>
No difference in performance, but local easier to analyze and global easier to
implement.
</p>

<p>
Fixed-resident set implies local replacement, otherwise not fixed size.
</p>

<p>
Variable-allocation can be either local or global.
</p>
</div>
<ol class="org-ol">
<li><a id="orgb532da6"></a>Fixed Allocation, Local Scope<br />
<div class="outline-text-5" id="text-2-5-2-1">
<p>
A process running in main memory has a fixed number of frames and on a page
fault the page to be replaced is from the currently resident pages for the
process.
</p>

<p>
Amount of allocation given to process is decided based on type of application
and amount requested by the program.
</p>

<p>
If too little allocated, high page fault rate, if too much allocated, too few
programs in main memory so too much swapping.
</p>
</div>
</li>
<li><a id="orgb9db376"></a>Variable Allocation, Global Scope<br />
<div class="outline-text-5" id="text-2-5-2-2">
<p>
Easiest to implement.
</p>

<p>
OS maintains a list of free frames, and when a page fault occurs, a free frame is
added to the resident set of a process and the page is brought in.
</p>

<p>
A process experiencing page faults grows in size which reduces page faults.
</p>

<p>
Replacement selection is made from all frames in memory, so the process that
suffers the reduction is resident set size may not be optimum.
</p>

<p>
To counter potential performance problems, use page buffering so that the choice
of which page to replace is less significant as the page can be reclaimed if
referenced before the next block of pages are overwritten.
</p>
</div>
</li>
<li><a id="org03bc15b"></a>Variable Allocation, Local Scope<br />
<div class="outline-text-5" id="text-2-5-2-3">
<p>
Overcomes problems of global-scope.
</p>

<p>
Strategy is:
</p>
<ol class="org-ol">
<li>when a new process is loaded into main memory, allocate to it a certain
number of page frames as its resident set based on application type, program
request or other criteria, with prepaging or demand paging to fill the
allocation</li>
<li>when a page fault occurs, select the page to replace from among the resident
set of the process that suffers the fault</li>
<li>from time to time, reevaluate the allocation provided to the process and
increase/decrease it to improve overall performance</li>
</ol>

<p>
With this, changes to resident set size are deliberate and based on the likely
future demands of active processes.
</p>

<p>
More complex but better performance.
Key elements are criteria used to determine resident set size and timing of
changes.
</p>

<p>
<b>Working set strategy</b>: set of pages of a process that have been referenced
in the last \(t\) logical time units
</p>

<p>
For many programs, periods of stable working set sizes alternate with periods of
rapid change.
Processes begin transient, then go back and forth between stability and transition.
</p>

<p>
Strategy for resident set size:
</p>
<ol class="org-ol">
<li>monitor the working set of each process</li>
<li>periodically remove from the resident set of a process pages that are not in
its working set, basically LRU</li>
<li>a process may execute only if its working set is in main memory</li>
</ol>

<p>
This exploits locality to minimize page faults.
</p>

<p>
Problems with working set strategy:
</p>
<ol class="org-ol">
<li>past does not always predict future, so size and membership of working set will
change over time</li>
<li>true measurement of working set for each process is impractical, as this would
require timestamps and time-ordered queue of pages</li>
<li>optimal value of \(t\) is unknown and would vary</li>
</ol>

<p>
Real implementations monitor page fault rate rather than working set directly.
Page fault rate low means smaller resident set, and vice versa.
</p>
</div>
</li>
</ol>
</div>
</div>
