3A/SE350/Virtual-Memory.tex
\subsection{Resident Set Management}
\label{sec:org96f51b2}
\subsubsection{Resident Set Size}
\label{sec:orgf3a6ed8}
With paged virtual memory, not all pages of a process need to be in main memory.
OS must decide how many pages to bring in.

Factors to decide this:
\begin{itemize}
\item less memory per process means more processes in main memory, so higher probability
that OS will find at least one ready process so less time lost to swapping
\item if a small number of pages of a process are in main memory, more page fualts
\item beyond a certain size, more main memory allocation for a process has no
noticeable effect on page fault rate for that process
\end{itemize}

\textbf{Fixed-allocation Policy}: gives a process a fixed number of frames in main memory
within which to execute
\begin{itemize}
\item number decided at process creation and depends on type of process or programmer
\item when a page fault occurs, one page of that process must be replaced by the needed
page
\end{itemize}

\textbf{Variable-allocation Policy}: number of page frames allocated to a process is
varied over process lifetime
\begin{itemize}
\item if many page faults, then more page frames and vice versa
\item relates to the concept of replacement scope
\item requires more software overhead
\end{itemize}
\subsubsection{Replacement Scope}
\label{sec:org0b2b72c}
Both policies activated by a page fault when there are no free page frames.

\textbf{Local replacement policy}: chooses only among resident pages of a process that
generated the page fault in selecting a page to replace

\textbf{Global replacement policy}: considers all unlocked pages in main memory as
candidates for replacement, regardless of ownership

No difference in performance, but local easier to analyze and global easier to
implement.

Fixed-resident set implies local replacement, otherwise not fixed size.

Variable-allocation can be either local or global.
\begin{enumerate}
\item Fixed Allocation, Local Scope
\label{sec:orgfd2c84a}
A process running in main memory has a fixed number of frames and on a page
fault the page to be replaced is from the currently resident pages for the
process.

Amount of allocation given to process is decided based on type of application
and amount requested by the program.

If too little allocated, high page fault rate, if too much allocated, too few
programs in main memory so too much swapping.
\item Variable Allocation, Global Scope
\label{sec:org5733526}
Easiest to implement.

OS maintains a list of free frames, and when a page fault occurs, a free frame is
added to the resident set of a process and the page is brought in.

A process experiencing page faults grows in size which reduces page faults.

Replacement selection is made from all frames in memory, so the process that
suffers the reduction is resident set size may not be optimum.

To counter potential performance problems, use page buffering so that the choice
of which page to replace is less significant as the page can be reclaimed if
referenced before the next block of pages are overwritten.
\item Variable Allocation, Local Scope
\label{sec:org19b926a}
Overcomes problems of global-scope.

Strategy is:
\begin{enumerate}
\item when a new process is loaded into main memory, allocate to it a certain
number of page frames as its resident set based on application type, program
request or other criteria, with prepaging or demand paging to fill the
allocation
\item when a page fault occurs, select the page to replace from among the resident
set of the process that suffers the fault
\item from time to time, reevaluate the allocation provided to the process and
increase/decrease it to improve overall performance
\end{enumerate}

With this, changes to resident set size are deliberate and based on the likely
future demands of active processes.

More complex but better performance.
Key elements are criteria used to determine resident set size and timing of
changes.

\textbf{Working set strategy}: set of pages of a process that have been referenced
in the last \(t\) logical time units

For many programs, periods of stable working set sizes alternate with periods of
rapid change.
Processes begin transient, then go back and forth between stability and transition.

Strategy for resident set size:
\begin{enumerate}
\item monitor the working set of each process
\item periodically remove from the resident set of a process pages that are not in
its working set, basically LRU
\item a process may execute only if its working set is in main memory
\end{enumerate}

This exploits locality to minimize page faults.

Problems with working set strategy:
\begin{enumerate}
\item past does not always predict future, so size and membership of working set will
change over time
\item true measurement of working set for each process is impractical, as this would
require timestamps and time-ordered queue of pages
\item optimal value of \(t\) is unknown and would vary
\end{enumerate}

Real implementations monitor page fault rate rather than working set directly.
Page fault rate low means smaller resident set, and vice versa.
\end{enumerate}
