3A/SE350/Virtual-Memory.org
** Cleaning Policy
Concerned with determining when a modified page should be written out to secondary memory.

*Demand cleaning*: a page is written to secondary memory only when selected for replacement.
- writing a dirty page is coupled with reading a new one
- minimized page writes but a process with a page fault must wait for 2 page transfers
  before becoming unblocked

*Precleaning*: writes modified pages before their page frames are needed so pages can be
written out in batched
- allows the writing of pages in batches, but this only makes sense when many pages have
  been modified before they are replaced
- otherwise wastes transfer capacity of secondary memory

Better approach uses page buffering by cleaning only pages that are replaceable, but
cleaning and replacement are decoupled.
Replaced pages can be placed on modified and unmodified lists, where modified list can
periodically be written out in batches and moved to unmodified list.
A page on the unmodified list is either reclaimed if referenced or lost when frame
assigned to another page.

** Load Control
Concerned with determining the number of processes resident in main memory.

Too few processes resident means all blocked is more frequent, too many processes
resident means many page faults, so thrashing.

*** Multiprogramming Level
Number of processes resident in main memory.

Working set or page-fault frequency monitoring implicitly incorporate load control.

$L = S$ criterion adjusts the multiprogramming level so the mean time between faults
is the mean time required to process a page fault, which yields maximum processor
utilization.

50% criterion attempts to keep utilization of the paging device at approx. 50%,
which also yields maximum processor utilization.

Could also adapt clock page replacement algorithm by monitoring the rate at which
the pointer scans the circular buffer of frames.
If the rate is below a threshold, either few page faults are occurring or for each
request, average number of frames scanned is small so many resident pages are not
referenced.
In both cases, multiprogramming level can be increased.
High pointer scan rate implies opposite.

*** Process Suspension
If the degree of multiprogramming is reduced, resident processes must be suspended.

Possibilities for this are:
- *lowest-priority process*: implements scheduling policy decision and unrelated
  to performance issues
- *faulting process*: greater probability that faulting task does not have its
  working set resident so performance would suffer least by suspending it and
  blocks a process that will be blocked anyways
- *last process activated*: process least likely to have its working set resident
- *process with smallest resident set*: least future effort to reload, but
  penalizes programs with strong locality
- *largest process*: most free frames
- *process with largest remaining execution window*: approximates a
  shortest-processing-time-first scheduling discipline
