3A/SE350/Virtual-Memory.html
<div id="outline-container-org234def6" class="outline-3">
<h3 id="org234def6"><span class="section-number-3">2.6.</span> Cleaning Policy</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Concerned with determining when a modified page should be written out to secondary memory.
</p>

<p>
<b>Demand cleaning</b>: a page is written to secondary memory only when selected for replacement.
</p>
<ul class="org-ul">
<li>writing a dirty page is coupled with reading a new one</li>
<li>minimized page writes but a process with a page fault must wait for 2 page transfers
before becoming unblocked</li>
</ul>

<p>
<b>Precleaning</b>: writes modified pages before their page frames are needed so pages can be
written out in batched
</p>
<ul class="org-ul">
<li>allows the writing of pages in batches, but this only makes sense when many pages have
been modified before they are replaced</li>
<li>otherwise wastes transfer capacity of secondary memory</li>
</ul>

<p>
Better approach uses page buffering by cleaning only pages that are replaceable, but
cleaning and replacement are decoupled.
Replaced pages can be placed on modified and unmodified lists, where modified list can
periodically be written out in batches and moved to unmodified list.
A page on the unmodified list is either reclaimed if referenced or lost when frame
assigned to another page.
</p>
</div>
</div>
<div id="outline-container-org96accc2" class="outline-3">
<h3 id="org96accc2"><span class="section-number-3">2.7.</span> Load Control</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Concerned with determining the number of processes resident in main memory.
</p>

<p>
Too few processes resident means all blocked is more frequent, too many processes
resident means many page faults, so thrashing.
</p>
</div>
<div id="outline-container-org5c420d3" class="outline-4">
<h4 id="org5c420d3"><span class="section-number-4">2.7.1.</span> Multiprogramming Level</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Number of processes resident in main memory.
</p>

<p>
Working set or page-fault frequency monitoring implicitly incorporate load control.
</p>

<p>
\(L = S\) criterion adjusts the multiprogramming level so the mean time between faults
is the mean time required to process a page fault, which yields maximum processor
utilization.
</p>

<p>
50% criterion attempts to keep utilization of the paging device at approx. 50%,
which also yields maximum processor utilization.
</p>

<p>
Could also adapt clock page replacement algorithm by monitoring the rate at which
the pointer scans the circular buffer of frames.
If the rate is below a threshold, either few page faults are occurring or for each
request, average number of frames scanned is small so many resident pages are not
referenced.
In both cases, multiprogramming level can be increased.
High pointer scan rate implies opposite.
</p>
</div>
</div>
<div id="outline-container-orgdc20261" class="outline-4">
<h4 id="orgdc20261"><span class="section-number-4">2.7.2.</span> Process Suspension</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
If the degree of multiprogramming is reduced, resident processes must be suspended.
</p>

<p>
Possibilities for this are:
</p>
<ul class="org-ul">
<li><b>lowest-priority process</b>: implements scheduling policy decision and unrelated
to performance issues</li>
<li><b>faulting process</b>: greater probability that faulting task does not have its
working set resident so performance would suffer least by suspending it and
blocks a process that will be blocked anyways</li>
<li><b>last process activated</b>: process least likely to have its working set resident</li>
<li><b>process with smallest resident set</b>: least future effort to reload, but
penalizes programs with strong locality</li>
<li><b>largest process</b>: most free frames</li>
<li><b>process with largest remaining execution window</b>: approximates a
shortest-processing-time-first scheduling discipline</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-06 Wed 02:32</p>
</div>
</body>
</html>
