3A/SE350/Virtual-Memory.tex
\subsection{Cleaning Policy}
\label{sec:org5fc3c68}
Concerned with determining when a modified page should be written out to secondary memory.

\textbf{Demand cleaning}: a page is written to secondary memory only when selected for replacement.
\begin{itemize}
\item writing a dirty page is coupled with reading a new one
\item minimized page writes but a process with a page fault must wait for 2 page transfers
before becoming unblocked
\end{itemize}

\textbf{Precleaning}: writes modified pages before their page frames are needed so pages can be
written out in batched
\begin{itemize}
\item allows the writing of pages in batches, but this only makes sense when many pages have
been modified before they are replaced
\item otherwise wastes transfer capacity of secondary memory
\end{itemize}

Better approach uses page buffering by cleaning only pages that are replaceable, but
cleaning and replacement are decoupled.
Replaced pages can be placed on modified and unmodified lists, where modified list can
periodically be written out in batches and moved to unmodified list.
A page on the unmodified list is either reclaimed if referenced or lost when frame
assigned to another page.
\subsection{Load Control}
\label{sec:org9c4c234}
Concerned with determining the number of processes resident in main memory.

Too few processes resident means all blocked is more frequent, too many processes
resident means many page faults, so thrashing.
\subsubsection{Multiprogramming Level}
\label{sec:org78ec9ce}
Number of processes resident in main memory.

Working set or page-fault frequency monitoring implicitly incorporate load control.

\(L = S\) criterion adjusts the multiprogramming level so the mean time between faults
is the mean time required to process a page fault, which yields maximum processor
utilization.

50\% criterion attempts to keep utilization of the paging device at approx. 50\%,
which also yields maximum processor utilization.

Could also adapt clock page replacement algorithm by monitoring the rate at which
the pointer scans the circular buffer of frames.
If the rate is below a threshold, either few page faults are occurring or for each
request, average number of frames scanned is small so many resident pages are not
referenced.
In both cases, multiprogramming level can be increased.
High pointer scan rate implies opposite.
\subsubsection{Process Suspension}
\label{sec:org0243796}
If the degree of multiprogramming is reduced, resident processes must be suspended.

Possibilities for this are:
\begin{itemize}
\item \textbf{lowest-priority process}: implements scheduling policy decision and unrelated
to performance issues
\item \textbf{faulting process}: greater probability that faulting task does not have its
working set resident so performance would suffer least by suspending it and
blocks a process that will be blocked anyways
\item \textbf{last process activated}: process least likely to have its working set resident
\item \textbf{process with smallest resident set}: least future effort to reload, but
penalizes programs with strong locality
\item \textbf{largest process}: most free frames
\item \textbf{process with largest remaining execution window}: approximates a
shortest-processing-time-first scheduling discipline
\end{itemize}
\end{document}
